STMicroelectronics/STM32CubeH7RS/Projects/STM32H7S78-DK/Templates_LL/Boot/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2023 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32h7rsxx_ll_rcc.h"
#include "stm32h7rsxx_ll_crs.h"
#include "stm32h7rsxx_ll_bus.h"
#include "stm32h7rsxx_ll_system.h"
#include "stm32h7rsxx_ll_exti.h"
#include "stm32h7rsxx_ll_cortex.h"
#include "stm32h7rsxx_ll_utils.h"
#include "stm32h7rsxx_ll_pwr.h"
#include "stm32h7rsxx_ll_dma.h"
#include "stm32h7rsxx_ll_gpio.h"

#if defined(USE_FULL_ASSERT)
#include "stm32_assert.h"
#endif /* USE_FULL_ASSERT */

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */
/* ==============   BOARD SPECIFIC CONFIGURATION CODE BEGIN    ============== */
/**
  * @brief LED
  */
#define LD1_Pin                                LL_GPIO_PIN_1
#define LD1_GPIO_PORT                          GPIOO
#define LD1_GPIO_CLK_ENABLE()                  LL_AHB4_GRP1_EnableClock(LL_AHB4_GRP1_PERIPH_GPIOO)

#define LD2_PIN                                LL_GPIO_PIN_5
#define LD2_GPIO_PORT                          GPIOO
#define LD2_GPIO_CLK_ENABLE()                  LL_AHB4_GRP1_EnableClock(LL_AHB4_GRP1_PERIPH_GPIOO)

#define LD3_PIN                                LL_GPIO_PIN_2
#define LD3_GPIO_PORT                          GPIOM
#define LD3_GPIO_CLK_ENABLE()                  LL_AHB4_GRP1_EnableClock(LL_AHB4_GRP1_PERIPH_GPIOM)

#define LD4_                                LL_GPIO_PIN_3
#define LD4_GPIO_PORT                          GPIOM
#define LD4_GPIO_CLK_ENABLE()                  LL_AHB4_GRP1_EnableClock(LL_AHB4_GRP1_PERIPH_GPIOM)

/**
  * @brief Buttons
  */
#define BUTTON_USER_PIN                         LL_GPIO_PIN_13
#define BUTTON_USER_GPIO_PORT                   GPIOC
#define BUTTON_USER_GPIO_CLK_ENABLE()           LL_AHB4_GRP1_EnableClock(LL_AHB4_GRP1_PERIPH_GPIOC)
#define BUTTON_USER_EXTI_LINE                   LL_EXTI_LINE_13
#define BUTTON_USER_EXTI_IRQn                   EXTI13_IRQn
#define BUTTON_USER_EXTI_LINE_ENABLE()          LL_EXTI_EnableIT_0_31(LL_EXTI_LINE_13)
#define BUTTON_USER_EXTI_FALLING_TRIG_ENABLE()  LL_EXTI_EnableFallingTrig_0_31(LL_EXTI_LINE_13)
#define BUTTON_USER_IRQHANDLER                  EXTI13_IRQHandler

/* ==============   BOARD SPECIFIC CONFIGURATION CODE END      ============== */
/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#ifndef NVIC_PRIORITYGROUP_0
#define NVIC_PRIORITYGROUP_0         ((uint32_t)0x00000007) /*!< 0 bit  for pre-emption priority,
                                                                 4 bits for subpriority */
#define NVIC_PRIORITYGROUP_1         ((uint32_t)0x00000006) /*!< 1 bit  for pre-emption priority,
                                                                 3 bits for subpriority */
#define NVIC_PRIORITYGROUP_2         ((uint32_t)0x00000005) /*!< 2 bits for pre-emption priority,
                                                                 2 bits for subpriority */
#define NVIC_PRIORITYGROUP_3         ((uint32_t)0x00000004) /*!< 3 bits for pre-emption priority,
                                                                 1 bit  for subpriority */
#define NVIC_PRIORITYGROUP_4         ((uint32_t)0x00000003) /*!< 4 bits for pre-emption priority,
                                                                 0 bit  for subpriority */
#endif

/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */
